Revit 2027 API
FabricationAncillaryUsage.AncillaryDepth Property
 Depth of required ancillary if it isn't round.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AncillaryDepth { get; }
Public ReadOnly Property AncillaryDepth As Double
	Get
public:
property double AncillaryDepth {
	double get ();
}
member AncillaryDepth : float with get
Property Value
Double
See Also
Reference
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace